hrshygoodness/Luminary-Micro-Library/inc/lm4fsxah5bb.h
//*****************************************************************************
//
// GPIO registers (PORTG AHB)
//
//*****************************************************************************
#define GPIO_PORTG_AHB_DATA_BITS_R \
                                ((volatile unsigned long *)0x4005E000)
#define GPIO_PORTG_AHB_DATA_R   (*((volatile unsigned long *)0x4005E3FC))
#define GPIO_PORTG_AHB_DIR_R    (*((volatile unsigned long *)0x4005E400))
#define GPIO_PORTG_AHB_IS_R     (*((volatile unsigned long *)0x4005E404))
#define GPIO_PORTG_AHB_IBE_R    (*((volatile unsigned long *)0x4005E408))
#define GPIO_PORTG_AHB_IEV_R    (*((volatile unsigned long *)0x4005E40C))
#define GPIO_PORTG_AHB_IM_R     (*((volatile unsigned long *)0x4005E410))
#define GPIO_PORTG_AHB_RIS_R    (*((volatile unsigned long *)0x4005E414))
#define GPIO_PORTG_AHB_MIS_R    (*((volatile unsigned long *)0x4005E418))
#define GPIO_PORTG_AHB_ICR_R    (*((volatile unsigned long *)0x4005E41C))
#define GPIO_PORTG_AHB_AFSEL_R  (*((volatile unsigned long *)0x4005E420))
#define GPIO_PORTG_AHB_DR2R_R   (*((volatile unsigned long *)0x4005E500))
#define GPIO_PORTG_AHB_DR4R_R   (*((volatile unsigned long *)0x4005E504))
#define GPIO_PORTG_AHB_DR8R_R   (*((volatile unsigned long *)0x4005E508))
#define GPIO_PORTG_AHB_ODR_R    (*((volatile unsigned long *)0x4005E50C))
#define GPIO_PORTG_AHB_PUR_R    (*((volatile unsigned long *)0x4005E510))
#define GPIO_PORTG_AHB_PDR_R    (*((volatile unsigned long *)0x4005E514))
#define GPIO_PORTG_AHB_SLR_R    (*((volatile unsigned long *)0x4005E518))
#define GPIO_PORTG_AHB_DEN_R    (*((volatile unsigned long *)0x4005E51C))
#define GPIO_PORTG_AHB_LOCK_R   (*((volatile unsigned long *)0x4005E520))
#define GPIO_PORTG_AHB_CR_R     (*((volatile unsigned long *)0x4005E524))
#define GPIO_PORTG_AHB_AMSEL_R  (*((volatile unsigned long *)0x4005E528))
#define GPIO_PORTG_AHB_PCTL_R   (*((volatile unsigned long *)0x4005E52C))
#define GPIO_PORTG_AHB_ADCCTL_R (*((volatile unsigned long *)0x4005E530))
#define GPIO_PORTG_AHB_DMACTL_R (*((volatile unsigned long *)0x4005E534))
#define GPIO_PORTG_AHB_SI_R     (*((volatile unsigned long *)0x4005E538))

//*****************************************************************************
//
// GPIO registers (PORTH AHB)
//
//*****************************************************************************
#define GPIO_PORTH_AHB_DATA_BITS_R \
                                ((volatile unsigned long *)0x4005F000)
#define GPIO_PORTH_AHB_DATA_R   (*((volatile unsigned long *)0x4005F3FC))
#define GPIO_PORTH_AHB_DIR_R    (*((volatile unsigned long *)0x4005F400))
#define GPIO_PORTH_AHB_IS_R     (*((volatile unsigned long *)0x4005F404))
#define GPIO_PORTH_AHB_IBE_R    (*((volatile unsigned long *)0x4005F408))
#define GPIO_PORTH_AHB_IEV_R    (*((volatile unsigned long *)0x4005F40C))
#define GPIO_PORTH_AHB_IM_R     (*((volatile unsigned long *)0x4005F410))
#define GPIO_PORTH_AHB_RIS_R    (*((volatile unsigned long *)0x4005F414))
#define GPIO_PORTH_AHB_MIS_R    (*((volatile unsigned long *)0x4005F418))
#define GPIO_PORTH_AHB_ICR_R    (*((volatile unsigned long *)0x4005F41C))
#define GPIO_PORTH_AHB_AFSEL_R  (*((volatile unsigned long *)0x4005F420))
#define GPIO_PORTH_AHB_DR2R_R   (*((volatile unsigned long *)0x4005F500))
#define GPIO_PORTH_AHB_DR4R_R   (*((volatile unsigned long *)0x4005F504))
#define GPIO_PORTH_AHB_DR8R_R   (*((volatile unsigned long *)0x4005F508))
#define GPIO_PORTH_AHB_ODR_R    (*((volatile unsigned long *)0x4005F50C))
#define GPIO_PORTH_AHB_PUR_R    (*((volatile unsigned long *)0x4005F510))
#define GPIO_PORTH_AHB_PDR_R    (*((volatile unsigned long *)0x4005F514))
#define GPIO_PORTH_AHB_SLR_R    (*((volatile unsigned long *)0x4005F518))
#define GPIO_PORTH_AHB_DEN_R    (*((volatile unsigned long *)0x4005F51C))
#define GPIO_PORTH_AHB_LOCK_R   (*((volatile unsigned long *)0x4005F520))
#define GPIO_PORTH_AHB_CR_R     (*((volatile unsigned long *)0x4005F524))
#define GPIO_PORTH_AHB_AMSEL_R  (*((volatile unsigned long *)0x4005F528))
#define GPIO_PORTH_AHB_PCTL_R   (*((volatile unsigned long *)0x4005F52C))
#define GPIO_PORTH_AHB_ADCCTL_R (*((volatile unsigned long *)0x4005F530))
#define GPIO_PORTH_AHB_DMACTL_R (*((volatile unsigned long *)0x4005F534))
#define GPIO_PORTH_AHB_SI_R     (*((volatile unsigned long *)0x4005F538))

//*****************************************************************************
//
// GPIO registers (PORTJ AHB)
//
//*****************************************************************************
#define GPIO_PORTJ_AHB_DATA_BITS_R \
                                ((volatile unsigned long *)0x40060000)
#define GPIO_PORTJ_AHB_DATA_R   (*((volatile unsigned long *)0x400603FC))
#define GPIO_PORTJ_AHB_DIR_R    (*((volatile unsigned long *)0x40060400))
#define GPIO_PORTJ_AHB_IS_R     (*((volatile unsigned long *)0x40060404))
#define GPIO_PORTJ_AHB_IBE_R    (*((volatile unsigned long *)0x40060408))
#define GPIO_PORTJ_AHB_IEV_R    (*((volatile unsigned long *)0x4006040C))
#define GPIO_PORTJ_AHB_IM_R     (*((volatile unsigned long *)0x40060410))
#define GPIO_PORTJ_AHB_RIS_R    (*((volatile unsigned long *)0x40060414))
#define GPIO_PORTJ_AHB_MIS_R    (*((volatile unsigned long *)0x40060418))
#define GPIO_PORTJ_AHB_ICR_R    (*((volatile unsigned long *)0x4006041C))
#define GPIO_PORTJ_AHB_AFSEL_R  (*((volatile unsigned long *)0x40060420))
#define GPIO_PORTJ_AHB_DR2R_R   (*((volatile unsigned long *)0x40060500))
#define GPIO_PORTJ_AHB_DR4R_R   (*((volatile unsigned long *)0x40060504))
#define GPIO_PORTJ_AHB_DR8R_R   (*((volatile unsigned long *)0x40060508))
#define GPIO_PORTJ_AHB_ODR_R    (*((volatile unsigned long *)0x4006050C))
#define GPIO_PORTJ_AHB_PUR_R    (*((volatile unsigned long *)0x40060510))
#define GPIO_PORTJ_AHB_PDR_R    (*((volatile unsigned long *)0x40060514))
#define GPIO_PORTJ_AHB_SLR_R    (*((volatile unsigned long *)0x40060518))
#define GPIO_PORTJ_AHB_DEN_R    (*((volatile unsigned long *)0x4006051C))
#define GPIO_PORTJ_AHB_LOCK_R   (*((volatile unsigned long *)0x40060520))
#define GPIO_PORTJ_AHB_CR_R     (*((volatile unsigned long *)0x40060524))
#define GPIO_PORTJ_AHB_AMSEL_R  (*((volatile unsigned long *)0x40060528))
#define GPIO_PORTJ_AHB_PCTL_R   (*((volatile unsigned long *)0x4006052C))
#define GPIO_PORTJ_AHB_ADCCTL_R (*((volatile unsigned long *)0x40060530))
#define GPIO_PORTJ_AHB_DMACTL_R (*((volatile unsigned long *)0x40060534))
#define GPIO_PORTJ_AHB_SI_R     (*((volatile unsigned long *)0x40060538))

//*****************************************************************************
//
// GPIO registers (PORTK)
//
//*****************************************************************************
#define GPIO_PORTK_DATA_BITS_R  ((volatile unsigned long *)0x40061000)
#define GPIO_PORTK_DATA_R       (*((volatile unsigned long *)0x400613FC))
#define GPIO_PORTK_DIR_R        (*((volatile unsigned long *)0x40061400))
#define GPIO_PORTK_IS_R         (*((volatile unsigned long *)0x40061404))
#define GPIO_PORTK_IBE_R        (*((volatile unsigned long *)0x40061408))
#define GPIO_PORTK_IEV_R        (*((volatile unsigned long *)0x4006140C))
#define GPIO_PORTK_IM_R         (*((volatile unsigned long *)0x40061410))
#define GPIO_PORTK_RIS_R        (*((volatile unsigned long *)0x40061414))
#define GPIO_PORTK_MIS_R        (*((volatile unsigned long *)0x40061418))
#define GPIO_PORTK_ICR_R        (*((volatile unsigned long *)0x4006141C))
#define GPIO_PORTK_AFSEL_R      (*((volatile unsigned long *)0x40061420))
#define GPIO_PORTK_DR2R_R       (*((volatile unsigned long *)0x40061500))
#define GPIO_PORTK_DR4R_R       (*((volatile unsigned long *)0x40061504))
#define GPIO_PORTK_DR8R_R       (*((volatile unsigned long *)0x40061508))
#define GPIO_PORTK_ODR_R        (*((volatile unsigned long *)0x4006150C))
#define GPIO_PORTK_PUR_R        (*((volatile unsigned long *)0x40061510))
#define GPIO_PORTK_PDR_R        (*((volatile unsigned long *)0x40061514))
#define GPIO_PORTK_SLR_R        (*((volatile unsigned long *)0x40061518))
#define GPIO_PORTK_DEN_R        (*((volatile unsigned long *)0x4006151C))
#define GPIO_PORTK_LOCK_R       (*((volatile unsigned long *)0x40061520))
#define GPIO_PORTK_CR_R         (*((volatile unsigned long *)0x40061524))
#define GPIO_PORTK_AMSEL_R      (*((volatile unsigned long *)0x40061528))
#define GPIO_PORTK_PCTL_R       (*((volatile unsigned long *)0x4006152C))
#define GPIO_PORTK_ADCCTL_R     (*((volatile unsigned long *)0x40061530))
#define GPIO_PORTK_DMACTL_R     (*((volatile unsigned long *)0x40061534))
#define GPIO_PORTK_SI_R         (*((volatile unsigned long *)0x40061538))

//*****************************************************************************
//
// GPIO registers (PORTL)
//
//*****************************************************************************
#define GPIO_PORTL_DATA_BITS_R  ((volatile unsigned long *)0x40062000)
#define GPIO_PORTL_DATA_R       (*((volatile unsigned long *)0x400623FC))
#define GPIO_PORTL_DIR_R        (*((volatile unsigned long *)0x40062400))
#define GPIO_PORTL_IS_R         (*((volatile unsigned long *)0x40062404))
#define GPIO_PORTL_IBE_R        (*((volatile unsigned long *)0x40062408))
#define GPIO_PORTL_IEV_R        (*((volatile unsigned long *)0x4006240C))
#define GPIO_PORTL_IM_R         (*((volatile unsigned long *)0x40062410))
#define GPIO_PORTL_RIS_R        (*((volatile unsigned long *)0x40062414))
#define GPIO_PORTL_MIS_R        (*((volatile unsigned long *)0x40062418))
#define GPIO_PORTL_ICR_R        (*((volatile unsigned long *)0x4006241C))
#define GPIO_PORTL_AFSEL_R      (*((volatile unsigned long *)0x40062420))
#define GPIO_PORTL_DR2R_R       (*((volatile unsigned long *)0x40062500))
#define GPIO_PORTL_DR4R_R       (*((volatile unsigned long *)0x40062504))
#define GPIO_PORTL_DR8R_R       (*((volatile unsigned long *)0x40062508))
#define GPIO_PORTL_ODR_R        (*((volatile unsigned long *)0x4006250C))
#define GPIO_PORTL_PUR_R        (*((volatile unsigned long *)0x40062510))
#define GPIO_PORTL_PDR_R        (*((volatile unsigned long *)0x40062514))
#define GPIO_PORTL_SLR_R        (*((volatile unsigned long *)0x40062518))
#define GPIO_PORTL_DEN_R        (*((volatile unsigned long *)0x4006251C))
#define GPIO_PORTL_LOCK_R       (*((volatile unsigned long *)0x40062520))
#define GPIO_PORTL_CR_R         (*((volatile unsigned long *)0x40062524))
#define GPIO_PORTL_AMSEL_R      (*((volatile unsigned long *)0x40062528))
#define GPIO_PORTL_PCTL_R       (*((volatile unsigned long *)0x4006252C))
#define GPIO_PORTL_ADCCTL_R     (*((volatile unsigned long *)0x40062530))
#define GPIO_PORTL_DMACTL_R     (*((volatile unsigned long *)0x40062534))
#define GPIO_PORTL_SI_R         (*((volatile unsigned long *)0x40062538))

//*****************************************************************************
//
// GPIO registers (PORTM)
//
//*****************************************************************************
#define GPIO_PORTM_DATA_BITS_R  ((volatile unsigned long *)0x40063000)
#define GPIO_PORTM_DATA_R       (*((volatile unsigned long *)0x400633FC))
#define GPIO_PORTM_DIR_R        (*((volatile unsigned long *)0x40063400))
#define GPIO_PORTM_IS_R         (*((volatile unsigned long *)0x40063404))
#define GPIO_PORTM_IBE_R        (*((volatile unsigned long *)0x40063408))
#define GPIO_PORTM_IEV_R        (*((volatile unsigned long *)0x4006340C))
#define GPIO_PORTM_IM_R         (*((volatile unsigned long *)0x40063410))
#define GPIO_PORTM_RIS_R        (*((volatile unsigned long *)0x40063414))
#define GPIO_PORTM_MIS_R        (*((volatile unsigned long *)0x40063418))
#define GPIO_PORTM_ICR_R        (*((volatile unsigned long *)0x4006341C))
#define GPIO_PORTM_AFSEL_R      (*((volatile unsigned long *)0x40063420))
#define GPIO_PORTM_DR2R_R       (*((volatile unsigned long *)0x40063500))
#define GPIO_PORTM_DR4R_R       (*((volatile unsigned long *)0x40063504))
#define GPIO_PORTM_DR8R_R       (*((volatile unsigned long *)0x40063508))
#define GPIO_PORTM_ODR_R        (*((volatile unsigned long *)0x4006350C))
#define GPIO_PORTM_PUR_R        (*((volatile unsigned long *)0x40063510))
#define GPIO_PORTM_PDR_R        (*((volatile unsigned long *)0x40063514))
#define GPIO_PORTM_SLR_R        (*((volatile unsigned long *)0x40063518))
#define GPIO_PORTM_DEN_R        (*((volatile unsigned long *)0x4006351C))
#define GPIO_PORTM_LOCK_R       (*((volatile unsigned long *)0x40063520))
#define GPIO_PORTM_CR_R         (*((volatile unsigned long *)0x40063524))
#define GPIO_PORTM_AMSEL_R      (*((volatile unsigned long *)0x40063528))
#define GPIO_PORTM_PCTL_R       (*((volatile unsigned long *)0x4006352C))
#define GPIO_PORTM_ADCCTL_R     (*((volatile unsigned long *)0x40063530))
#define GPIO_PORTM_DMACTL_R     (*((volatile unsigned long *)0x40063534))
#define GPIO_PORTM_SI_R         (*((volatile unsigned long *)0x40063538))

//*****************************************************************************
//
// GPIO registers (PORTN)
//
//*****************************************************************************
#define GPIO_PORTN_DATA_BITS_R  ((volatile unsigned long *)0x40064000)
#define GPIO_PORTN_DATA_R       (*((volatile unsigned long *)0x400643FC))
#define GPIO_PORTN_DIR_R        (*((volatile unsigned long *)0x40064400))
#define GPIO_PORTN_IS_R         (*((volatile unsigned long *)0x40064404))
#define GPIO_PORTN_IBE_R        (*((volatile unsigned long *)0x40064408))
#define GPIO_PORTN_IEV_R        (*((volatile unsigned long *)0x4006440C))
#define GPIO_PORTN_IM_R         (*((volatile unsigned long *)0x40064410))
#define GPIO_PORTN_RIS_R        (*((volatile unsigned long *)0x40064414))
#define GPIO_PORTN_MIS_R        (*((volatile unsigned long *)0x40064418))
#define GPIO_PORTN_ICR_R        (*((volatile unsigned long *)0x4006441C))
#define GPIO_PORTN_AFSEL_R      (*((volatile unsigned long *)0x40064420))
#define GPIO_PORTN_DR2R_R       (*((volatile unsigned long *)0x40064500))
#define GPIO_PORTN_DR4R_R       (*((volatile unsigned long *)0x40064504))
#define GPIO_PORTN_DR8R_R       (*((volatile unsigned long *)0x40064508))
#define GPIO_PORTN_ODR_R        (*((volatile unsigned long *)0x4006450C))
#define GPIO_PORTN_PUR_R        (*((volatile unsigned long *)0x40064510))
#define GPIO_PORTN_PDR_R        (*((volatile unsigned long *)0x40064514))
#define GPIO_PORTN_SLR_R        (*((volatile unsigned long *)0x40064518))
#define GPIO_PORTN_DEN_R        (*((volatile unsigned long *)0x4006451C))
#define GPIO_PORTN_LOCK_R       (*((volatile unsigned long *)0x40064520))
#define GPIO_PORTN_CR_R         (*((volatile unsigned long *)0x40064524))
#define GPIO_PORTN_AMSEL_R      (*((volatile unsigned long *)0x40064528))
#define GPIO_PORTN_PCTL_R       (*((volatile unsigned long *)0x4006452C))
#define GPIO_PORTN_ADCCTL_R     (*((volatile unsigned long *)0x40064530))
#define GPIO_PORTN_DMACTL_R     (*((volatile unsigned long *)0x40064534))
#define GPIO_PORTN_SI_R         (*((volatile unsigned long *)0x40064538))

//*****************************************************************************
//
// GPIO registers (PORTP)
//
//*****************************************************************************
#define GPIO_PORTP_DATA_BITS_R  ((volatile unsigned long *)0x40065000)
#define GPIO_PORTP_DATA_R       (*((volatile unsigned long *)0x400653FC))
#define GPIO_PORTP_DIR_R        (*((volatile unsigned long *)0x40065400))
#define GPIO_PORTP_IS_R         (*((volatile unsigned long *)0x40065404))
#define GPIO_PORTP_IBE_R        (*((volatile unsigned long *)0x40065408))
#define GPIO_PORTP_IEV_R        (*((volatile unsigned long *)0x4006540C))
#define GPIO_PORTP_IM_R         (*((volatile unsigned long *)0x40065410))
#define GPIO_PORTP_RIS_R        (*((volatile unsigned long *)0x40065414))
#define GPIO_PORTP_MIS_R        (*((volatile unsigned long *)0x40065418))
#define GPIO_PORTP_ICR_R        (*((volatile unsigned long *)0x4006541C))
#define GPIO_PORTP_AFSEL_R      (*((volatile unsigned long *)0x40065420))
#define GPIO_PORTP_DR2R_R       (*((volatile unsigned long *)0x40065500))
#define GPIO_PORTP_DR4R_R       (*((volatile unsigned long *)0x40065504))
#define GPIO_PORTP_DR8R_R       (*((volatile unsigned long *)0x40065508))
#define GPIO_PORTP_ODR_R        (*((volatile unsigned long *)0x4006550C))
#define GPIO_PORTP_PUR_R        (*((volatile unsigned long *)0x40065510))
#define GPIO_PORTP_PDR_R        (*((volatile unsigned long *)0x40065514))
#define GPIO_PORTP_SLR_R        (*((volatile unsigned long *)0x40065518))
#define GPIO_PORTP_DEN_R        (*((volatile unsigned long *)0x4006551C))
#define GPIO_PORTP_LOCK_R       (*((volatile unsigned long *)0x40065520))
#define GPIO_PORTP_CR_R         (*((volatile unsigned long *)0x40065524))
#define GPIO_PORTP_AMSEL_R      (*((volatile unsigned long *)0x40065528))
#define GPIO_PORTP_PCTL_R       (*((volatile unsigned long *)0x4006552C))
#define GPIO_PORTP_ADCCTL_R     (*((volatile unsigned long *)0x40065530))
#define GPIO_PORTP_DMACTL_R     (*((volatile unsigned long *)0x40065534))
#define GPIO_PORTP_SI_R         (*((volatile unsigned long *)0x40065538))

//*****************************************************************************
//
// GPIO registers (PORTQ)
//
//*****************************************************************************
#define GPIO_PORTQ_DATA_BITS_R  ((volatile unsigned long *)0x40066000)
#define GPIO_PORTQ_DATA_R       (*((volatile unsigned long *)0x400663FC))
#define GPIO_PORTQ_DIR_R        (*((volatile unsigned long *)0x40066400))
#define GPIO_PORTQ_IS_R         (*((volatile unsigned long *)0x40066404))
#define GPIO_PORTQ_IBE_R        (*((volatile unsigned long *)0x40066408))
#define GPIO_PORTQ_IEV_R        (*((volatile unsigned long *)0x4006640C))
#define GPIO_PORTQ_IM_R         (*((volatile unsigned long *)0x40066410))
#define GPIO_PORTQ_RIS_R        (*((volatile unsigned long *)0x40066414))
#define GPIO_PORTQ_MIS_R        (*((volatile unsigned long *)0x40066418))
#define GPIO_PORTQ_ICR_R        (*((volatile unsigned long *)0x4006641C))
#define GPIO_PORTQ_AFSEL_R      (*((volatile unsigned long *)0x40066420))
#define GPIO_PORTQ_DR2R_R       (*((volatile unsigned long *)0x40066500))
#define GPIO_PORTQ_DR4R_R       (*((volatile unsigned long *)0x40066504))
#define GPIO_PORTQ_DR8R_R       (*((volatile unsigned long *)0x40066508))
#define GPIO_PORTQ_ODR_R        (*((volatile unsigned long *)0x4006650C))
#define GPIO_PORTQ_PUR_R        (*((volatile unsigned long *)0x40066510))
#define GPIO_PORTQ_PDR_R        (*((volatile unsigned long *)0x40066514))
#define GPIO_PORTQ_SLR_R        (*((volatile unsigned long *)0x40066518))
#define GPIO_PORTQ_DEN_R        (*((volatile unsigned long *)0x4006651C))
#define GPIO_PORTQ_LOCK_R       (*((volatile unsigned long *)0x40066520))
#define GPIO_PORTQ_CR_R         (*((volatile unsigned long *)0x40066524))
#define GPIO_PORTQ_AMSEL_R      (*((volatile unsigned long *)0x40066528))
#define GPIO_PORTQ_PCTL_R       (*((volatile unsigned long *)0x4006652C))
#define GPIO_PORTQ_ADCCTL_R     (*((volatile unsigned long *)0x40066530))
#define GPIO_PORTQ_DMACTL_R     (*((volatile unsigned long *)0x40066534))
#define GPIO_PORTQ_SI_R         (*((volatile unsigned long *)0x40066538))

//*****************************************************************************
//
// LPC registers (LPC0)
//
//*****************************************************************************
#define LPC0_CTL_R              (*((volatile unsigned long *)0x40080000))
#define LPC0_STS_R              (*((volatile unsigned long *)0x40080004))
#define LPC0_IRQCTL_R           (*((volatile unsigned long *)0x40080008))
#define LPC0_IRQST_R            (*((volatile unsigned long *)0x4008000C))
#define LPC0_CH0CTL_R           (*((volatile unsigned long *)0x40080010))
#define LPC0_CH0ST_R            (*((volatile unsigned long *)0x40080014))
#define LPC0_CH0ADR_R           (*((volatile unsigned long *)0x40080018))
#define LPC0_CH1CTL_R           (*((volatile unsigned long *)0x40080020))
#define LPC0_CH1ST_R            (*((volatile unsigned long *)0x40080024))
#define LPC0_CH1ADR_R           (*((volatile unsigned long *)0x40080028))
#define LPC0_CH2CTL_R           (*((volatile unsigned long *)0x40080030))
#define LPC0_CH2ST_R            (*((volatile unsigned long *)0x40080034))
#define LPC0_CH2ADR_R           (*((volatile unsigned long *)0x40080038))
#define LPC0_CH3CTL_R           (*((volatile unsigned long *)0x40080040))
#define LPC0_CH3ST_R            (*((volatile unsigned long *)0x40080044))
#define LPC0_CH3ADR_R           (*((volatile unsigned long *)0x40080048))
#define LPC0_CH4CTL_R           (*((volatile unsigned long *)0x40080050))
#define LPC0_CH4ST_R            (*((volatile unsigned long *)0x40080054))
#define LPC0_CH4ADR_R           (*((volatile unsigned long *)0x40080058))
#define LPC0_CH5CTL_R           (*((volatile unsigned long *)0x40080060))
#define LPC0_CH5ST_R            (*((volatile unsigned long *)0x40080064))
#define LPC0_CH5ADR_R           (*((volatile unsigned long *)0x40080068))
#define LPC0_CH6CTL_R           (*((volatile unsigned long *)0x40080070))
#define LPC0_CH6ST_R            (*((volatile unsigned long *)0x40080074))
#define LPC0_CH6ADR_R           (*((volatile unsigned long *)0x40080078))
#define LPC0_CH7CTL_R           (*((volatile unsigned long *)0x40080080))
#define LPC0_CH7ST_R            (*((volatile unsigned long *)0x40080084))
#define LPC0_CH7ADR_R           (*((volatile unsigned long *)0x40080088))
#define LPC0_STSADDR_R          (*((volatile unsigned long *)0x400800A0))
#define LPC0_IM_R               (*((volatile unsigned long *)0x40080100))
#define LPC0_RIS_R              (*((volatile unsigned long *)0x40080104))
#define LPC0_MIS_R              (*((volatile unsigned long *)0x40080108))
#define LPC0_IC_R               (*((volatile unsigned long *)0x4008010C))
#define LPC0_DMACX_R            (*((volatile unsigned long *)0x40080120))
#define LPC0_POOL_R             (*((volatile unsigned long *)0x40080400))
#define LPC0_PP_R               (*((volatile unsigned long *)0x40080FC0))

